In [1]:
print('hii')

hii

In [1]:
import numpy as np
import pandas as pd

In [2]:
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
def add(a,b):
    return a+b

add(2,3)

5

In [22]:
# Remove duplicates from a list but keep order
import pandas as pd

a=[1,2,1,3,4,5,6,23,4,2,4,1,4,2,4,2,4,55,3]

b=list(pd.Series(a).drop_duplicates().values)

print(a)
print(b)

[1, 2, 1, 3, 4, 5, 6, 23, 4, 2, 4, 1, 4, 2, 4, 2, 4, 55, 3]
[1, 2, 3, 4, 5, 6, 23, 55]

In [ ]:
from collections import Counter
text='hii hii hello hello hello'
print(Counter(text))

In [66]:
#Count frequency of words in a text
from collections import Counter

text = "AI ML AI Engineer AI"
print(Counter(text.split()))

Counter({'AI': 3, 'ML': 1, 'Engineer': 1})

In [15]:
a=[1,2,3,4,4232443,2,2,32,1,13,2323,3]
b=list(pd.Series(a).drop_duplicates())
b.sort()
print(b)

[1, 2, 3, 4, 13, 32, 2323, 4232443]

In [20]:
a=[1,2,1,3,4,5,6,23,4,2,4,1,4,2,4,2,4,55,3]

def remove_duplicates(input_list):
    seen=set()
    output=[]
    for item in input_list:
        if item not in seen:
            seen.add(item)
            output.append(item)
    return output
b=remove_duplicates(a)
print(b)

[1, 2, 3, 4, 5, 6, 23, 55]

In [ ]:
a=[1,2,1,3,4,5,6,23,4,2,4,1,4,2,4,2,4,55,3]
b=set(a)
c=list(b)
print(c)

[1, 2, 3, 4, 5, 6, 55, 23]

In [23]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [40]:
data= pd.Series([1,3,4,5,5,54,22,43,2,2,2,2,2,2],['a','b','c','d','e','f','g','h','i','j','k','l','m','n'])

In [38]:
data1=pd.DataFrame(data)

In [39]:
data1

    0
a   1
b   3
c   4
d   5
e   5
f  54
g  22
h  43
i   2
j   2
k   2
l   2
m   2
n   2

In [41]:
data= pd.DataFrame({1:'a',2:'b',3:'c',4:'d',5:'e',6:'f',7:'g',8:'h',9:'i',10:'j',11:'k',12:'l',13:'m',14:'n'},index=[0])

In [42]:
data

  1  2  3  4  5  6  7  8  9  10 11 12 13 14
0  a  b  c  d  e  f  g  h  i  j  k  l  m  n

In [47]:
data= pd.DataFrame(
    {
        'name':{0:'sachin',1:'rahul',2:'rohit',3:'virat',4:'dhoni'},
        'city':{0:'pune',1:'mumbai',2:'bangalore',3:'delhi',4:'chennai'},
        'education':{0:'btech',1:'bcom',2:'bsc',3:'ba',4:'bca'},
        'age':{0:32,1:34,2:33,3:35,4:40},
        'salary':{0:20000,1:25000,2:30000,3:40000,4:50000}

    }

)

In [48]:
data

     name       city education  age  salary
0  sachin       pune     btech   32   20000
1   rahul     mumbai      bcom   34   25000
2   rohit  bangalore       bsc   33   30000
3   virat      delhi        ba   35   40000
4   dhoni    chennai       bca   40   50000

In [49]:
data= pd.DataFrame({
    'name':['sachin','rahul','rohit','virat','dhoni'],
    'city':['pune','mumbai','bangalore','delhi','chennai'],
    'education':['btech','bcom','bsc','ba','bca'],
    'age':[32,34,33,35,40],
    'salary':[20000,25000,30000,40000,50000]
})

In [50]:
data

     name       city education  age  salary
0  sachin       pune     btech   32   20000
1   rahul     mumbai      bcom   34   25000
2   rohit  bangalore       bsc   33   30000
3   virat      delhi        ba   35   40000
4   dhoni    chennai       bca   40   50000

In [51]:
data.loc[1:3]

    name       city education  age  salary
1  rahul     mumbai      bcom   34   25000
2  rohit  bangalore       bsc   33   30000
3  virat      delhi        ba   35   40000

In [53]:
data.iloc[1:3]

    name       city education  age  salary
1  rahul     mumbai      bcom   34   25000
2  rohit  bangalore       bsc   33   30000

In [54]:
data['name']=data['name'].str.upper()

In [55]:
data

     name       city education  age  salary
0  SACHIN       pune     btech   32   20000
1   RAHUL     mumbai      bcom   34   25000
2   ROHIT  bangalore       bsc   33   30000
3   VIRAT      delhi        ba   35   40000
4   DHONI    chennai       bca   40   50000

In [56]:
data[data['age']>33]

    name     city education  age  salary
1  RAHUL   mumbai      bcom   34   25000
3  VIRAT    delhi        ba   35   40000
4  DHONI  chennai       bca   40   50000

In [58]:
data[data['name'].str.startswith('R')]

    name       city education  age  salary
1  RAHUL     mumbai      bcom   34   25000
2  ROHIT  bangalore       bsc   33   30000

In [59]:
data.replace({'name':{'SACHIN':'Sachin Tendulkar','ROHIT':'Rohit Sharma'}})

               name       city education  age  salary
0  Sachin Tendulkar       pune     btech   32   20000
1             RAHUL     mumbai      bcom   34   25000
2      Rohit Sharma  bangalore       bsc   33   30000
3             VIRAT      delhi        ba   35   40000
4             DHONI    chennai       bca   40   50000

In [61]:
data.replace('RAHUL','rahul dravid')

           name       city education  age  salary
0        SACHIN       pune     btech   32   20000
1  rahul dravid     mumbai      bcom   34   25000
2         ROHIT  bangalore       bsc   33   30000
3         VIRAT      delhi        ba   35   40000
4         DHONI    chennai       bca   40   50000

In [ ]:
data.replace('name':{'SACHIN','sachin', 'RAHUL','rahul'})

C:\Users\Sachin Awati\AppData\Local\Temp\ipykernel_24832\3221179266.py:1: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  data.replace({'SACHIN','sachin', 'RAHUL','rahul'})

     name       city education  age  salary
0  SACHIN       pune     btech   32   20000
1   RAHUL     mumbai      bcom   34   25000
2   ROHIT  bangalore       bsc   33   30000
3   VIRAT      delhi        ba   35   40000
4   DHONI    chennai       bca   40   50000